# IExternalResourceServer Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IExternalResourceServer Methods
IExternalResourceServer Interface See Also
---
The IExternalResourceServer type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AreSameResources | Implement this method to indicate whether two given resources are the same. |
| GetDescription | Implement this method to return a description of the server.  (Inherited from IExternalServer.) |
| GetIconPath | Implement this method to return the path to an icon file which will be displayed in Revit user interfaces associated to this server. |
| GetInformationLink | The method that Revit will invoke to obtain a URL address which provides more information about the server. |
| GetInSessionPath | Implement this method to provide the path that should be used for display and browsing to a given ExternalResourceReference during this Revit session. |
| GetName | Implement this method to return the name of the server.  (Inherited from IExternalServer.) |
| GetResourceVersionStatus | Implement this method to indicate whether the given version of a resource is the most current version of the data. |
| GetServerId | Implement this method to return the id of the server.  (Inherited from IExternalServer.) |
| GetServiceId | Implement this method to return the id of the service.  (Inherited from IExternalServer.) |
| GetShortName | Implement this method to return the short name of the server. |
| GetTypeSpecificServerOperations | Implement this method to get operations supported by the external server for a particular type of external resource. |
| GetVendorId | Implement this method to return the id of the vendor of the server.  (Inherited from IExternalServer.) |
| IsResourceWellFormed | Implement this method to check whether the given ExternalResourceReference is formatted correctly for this server. |
| LoadResource | Implement this method to load the requested resource. |
| SetupBrowserData | Implement this method to setup external resource browser data which will be accessed in Revit external resource browser UI. |
| SupportsExternalResourceType | Implement this method to indicate whether the server can provide data for a specified type of external resource. |

# See Also
IExternalResourceServer Interface
Autodesk.Revit.DB Namespace